var express = require("express");
var port = 3000;
var bodyParser = require("body-parser");
var app = express();


app.use(bodyParser.json());
app.use(
  bodyParser.urlencoded({
    extended: true
  })
);
 



//No. 1
// Get number like http://localhost:3000/p/34
app.get("/p/:number", function(req, res) {
  res.send(req.params.number);
});
 
// Get number like http://localhost:3000/p?number=5
app.get('/p', function (req, res) {
    res.send(req.query.number);
});

//No. 2

app.get('/abc', function tt (req, res) {
    var a = req.query.a;
    var b = req.query.b;
    var c = req.query.c;
    var D = b*b-4*(a*c);
    if (D>0) {
        var x1 = (-1 * b - (Math.sqrt(D))) / 2 * a;
        var x2 = (-1 * b + (Math.sqrt(D))) / 2 * a;
        res.send({x1:x1, x2:x2});
    }
    else{
        if (D === 0) {
            var x = (-1 * b) / 2 * a;
            res.send({x:x});
        }
        else{
            res.send("действительных корней нет");
        }
    }

});

//No. 3
app.get('/day', function (req, res) {
    var date = req.query.date;
    date = new Date(date);
    var day = date.getDay();
    var days = ['Воскресенье', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота'];
    res.send({
        days: days[day]
    });
});


 //NO. 4
 app.get("/fib/:num", function (req, res) {
    var n = req.params.num;
    var a = 1,
        b = 1;
    for (let i = 3; i <= n; i++) {
        var temp = a + b;
        a = b;
        b = temp;
     };
     res.send({
         "число Фибоначчи": b
     });
 });



  //NO. 5
  app.get("/rus/:reg", function (req, res) {
      var n = req.params.reg;
      var RUS = [
          [
              "22",
              "Алтайский край"
          ],
          [
              "28",
              "Амурская область"
          ],
          [
              "29",
              "Архангельская область"
          ],
          [
              "30",
              "Астраханская область"
          ],
          [
              "31",
              "Белгородская область"
          ],
          [
              "32",
              "Брянская область"
          ],
          [
              "33",
              "Владимирская область"
          ],
          [
              "34",
              "Волгоградская область"
          ],
          [
              "35",
              "Вологодская область"
          ],
          [
              "36",
              "Воронежская область"
          ],
          [
              "77",
              "г. Москва"
          ],
          [
              "79",
              "Еврейская автономная область"
          ],
          [
              "75",
              "Забайкальский край"
          ],
          [
              "37",
              "Ивановская область"
          ],
          [
              "99",
              "Иные территории, включая город и космодром Байконур"
          ],
          [
              "38",
              "Иркутская область"
          ],
          [
              "07",
              "Кабардино-Балкарская Республика"
          ],
          [
              "39",
              "Калининградская область"
          ],
          [
              "40",
              "Калужская область"
          ],
          [
              "41",
              "Камчатский край"
          ],
          [
              "09",
              "Карачаево-Черкесская Республика"
          ],
          [
              "42",
              "Кемеровская область"
          ],
          [
              "43",
              "Кировская область"
          ],
          [
              "44",
              "Костромская область"
          ],
          [
              "23",
              "Краснодарский край"
          ],
          [
              "24",
              "Красноярский край"
          ],
          [
              "45",
              "Курганская область"
          ],
          [
              "46",
              "Курская область"
          ],
          [
              "47",
              "Ленинградская область"
          ],
          [
              "48",
              "Липецкая область"
          ],
          [
              "49",
              "Магаданская область"
          ],
          [
              "50",
              "Московская область"
          ],
          [
              "51",
              "Мурманская область"
          ],
          [
              "83",
              "Ненецкий автономный округ"
          ],
          [
              "52",
              "Нижегородская область"
          ],
          [
              "53",
              "Новгородская область"
          ],
          [
              "54",
              "Новосибирская область"
          ],
          [
              "55",
              "Омская область"
          ],
          [
              "56",
              "Оренбургская область"
          ],
          [
              "57",
              "Орловская область"
          ],
          [
              "58",
              "Пензенская область"
          ],
          [
              "59",
              "Пермский край"
          ],
          [
              "25",
              "Приморский край"
          ],
          [
              "60",
              "Псковская область"
          ],
          [
              "01",
              "Республика Адыгея (Адыгея)"
          ],
          [
              "04",
              "Республика Алтай"
          ],
          [
              "02",
              "Республика Башкортостан"
          ],
          [
              "03",
              "Республика Бурятия"
          ],
          [
              "05",
              "Республика Дагестан"
          ],
          [
              "06",
              "Республика Ингушетия"
          ],
          [
              "08",
              "Республика Калмыкия"
          ],
          [
              "10",
              "Республика Карелия"
          ],
          [
              "11",
              "Республика Коми"
          ],
          [
              "91",
              "Республика Крым"
          ],
          [
              "12",
              "Республика Марий Эл"
          ],
          [
              "13",
              "Республика Мордовия"
          ],
          [
              "14",
              "Республика Саха (Якутия)"
          ],
          [
              "15",
              "Республика Северная Осетия - Алания"
          ],
          [
              "16",
              "Республика Татарстан (Татарстан)"
          ],
          [
              "17",
              "Республика Тыва"
          ],
          [
              "19",
              "Республика Хакасия"
          ],
          [
              "61",
              "Ростовская область"
          ],
          [
              "62",
              "Рязанская область"
          ],
          [
              "63",
              "Самарская область"
          ],
          [
              "78",
              "Санкт-Петербург"
          ],
          [
              "64",
              "Саратовская область"
          ],
          [
              "65",
              "Сахалинская область"
          ],
          [
              "66",
              "Свердловская область"
          ],
          [
              "92",
              "Севастополь"
          ],
          [
              "67",
              "Смоленская область"
          ],
          [
              "26",
              "Ставропольский край"
          ],
          [
              "68",
              "Тамбовская область"
          ],
          [
              "69",
              "Тверская область"
          ],
          [
              "70",
              "Томская область"
          ],
          [
              "71",
              "Тульская область"
          ],
          [
              "72",
              "Тюменская область"
          ],
          [
              "18",
              "Удмуртская Республика"
          ],
          [
              "73",
              "Ульяновская область"
          ],
          [
              "27",
              "Хабаровский край"
          ],
          [
              "86",
              "Ханты-Мансийский автономный округ - Югра"
          ],
          [
              "74",
              "Челябинская область"
          ],
          [
              "20",
              "Чеченская Республика"
          ],
          [
              "21",
              "Чувашская Республика - Чувашия"
          ],
          [
              "87",
              "Чукотский автономный округ"
          ],
          [
              "89",
              "Ямало-Ненецкий автономный округ"
          ],
          [
              "76",
              "Ярославская область"
          ]
      ];
      for (let index = 0; index < RUS.length; index++) {
          if (RUS[index][0]===n) {
              res.send({
                  'название региона России': RUS[index][1]
              });
          };
          
      };
      res.send("Совпадений нет");
  });

// Start the server
var server = app.listen(port, error => {
  if (error) return console.log(`Error: ${error}`);

  console.log(`Server listening on port ${server.address().port}`);
});